{
  "posts": [
    {
      "id": 1,
      "title": "Welcome to InfinitumNox Blog",
      "date": "2026-01-09",
      "author": "InfinitumNox",
      "excerpt": "Starting my journey of sharing thoughts, experiments, and discoveries in the world of AI-assisted development.",
      "content": "<p>Welcome to my blog! This is where I'll share my experiences, thoughts, and experiments in the fascinating world of AI-assisted development.</p><p>As someone who believes in the power of AI collaboration, I'll be documenting my journey, sharing insights, and exploring the boundaries of what's possible when humans and AI work together.</p><p>Stay tuned for more posts about coding adventures, project updates, and the occasional philosophical musings about technology and creativity.</p>",
      "tags": ["welcome", "blog", "ai-development"],
      "featured": true
    },
    {
      "id": 2,
      "title": "The Philosophy of AI-Assisted Development",
      "date": "2026-01-09",
      "author": "InfinitumNox",
      "excerpt": "Why I believe AI is a collaborator, not a replacement. Exploring the symbiotic relationship between human creativity and machine intelligence.",
      "content": "<p>There's a common misconception that using AI to code makes you 'less of a developer.' I strongly disagree.</p><p>AI tools like Claude, GitHub Copilot, and ChatGPT are not replacements for developers—they're force multipliers. They amplify your ability to translate ideas into reality, letting you focus on the creative and architectural aspects while handling boilerplate and repetitive tasks.</p><p>The key is understanding <em>how</em> to work with AI effectively. It's about:</p><ul><li>Asking the right questions</li><li>Iterating on solutions</li><li>Combining human intuition with AI precision</li><li>Knowing when to trust the AI and when to override it</li></ul><p>This is the future of development, and I'm excited to be part of it.</p>",
      "tags": ["ai", "philosophy", "development"],
      "featured": true
    },
    {
      "id": 3,
      "title": "Project Updates: Vïve & PurityPath",
      "date": "2026-01-08",
      "author": "InfinitumNox",
      "excerpt": "Quick updates on my ongoing projects and what's coming next in the development pipeline.",
      "content": "<p>I wanted to share some updates on my current projects:</p><h3>Vïve - Health Tracking Companion</h3><p>Work is progressing steadily on Vïve, my AI-powered health tracking application. The core tracking features are coming together nicely, and I'm exploring interesting ways to visualize health data.</p><h3>PurityPath - Wellness with Nomi AI</h3><p>PurityPath is in active development, integrating Nomi AI for a personalized wellness experience. The challenge has been creating meaningful interactions while respecting user privacy and data security.</p><p>More detailed posts about these projects coming soon!</p>",
      "tags": ["projects", "vive", "puritypath", "updates"],
      "featured": false
    }
  ]
}
